const ua = {

  Header: {
    Home: 'Домашня',
    'Poke Api': 'Поке Апі',
    'Firm Structure': 'Структура фірми',
    HeaderContactsText: 'адреса, локація та інше',
  },

  Description: {
    'Read Less': 'Згорнути',
    'Read More': 'Розгорнути',
    descriptionTitle: `Даний проект розкриває основні поняття git, 
                       node.js, а також торкається основ html та css.`,

    titleVcs: 'Що таке система контроля версій та навіщо вона потрібна',
    descriptionVcs: `
      Система контроля версій (VCS – Version Control System)
      – це система з допомогою якої можна фіксувати
      зміни у файлах, та при необхідності повертатись до них.
      Git – одна із самих популярних розподіленних систем.
      «Розподіленність» заключаеться в тому що у кожного
      розробника знаходиться повна копія проекту и всі
      одразу можуть працювати, а на сервері лежить основний
      репозиторій.
`,

    titleGit: 'checkout, add, commit, pull, push. Основи розгалудження та злиття',
    descriptionGit: `
      Команда checkout використовується з параметрами комміта,
      гілки та файлу. А також з параметрами та без них.
      - git checkout “branch” – переміщає вказівник HEAD на
      кінець заданної гілки.
      - git add . – добавляє в індекс усі файли поточної
      директорії.
      - git pull – завантажує віддалений вміст та одразу
      намагається замінити стан локального репозиторія,
      щоб воно відповідало цьому вмісту (виконує
      злиття).
      – git branch “new branch”(без переходу на new branch)
      або git checkout –b “new branch” (с переходом).
`,

    titleCss: 'Css: стилі, класи, ідентифікатори, селектори, псевдокласи, псевдоелементи',
    descriptionCss: `
    Стилі визначають зовнішній вигляд html елементів.
      Зв'язані – через підключення зовнішнього файлу зі
      стилями.
      Глобальні – обьявленые в теге 'style' 
      Внутренние – об'явлені через атрибут 'style' в тегі.
      Ідентифікатор елемента задається через атрибут “id”, та
      повинен бути унікальним.
      Псевдокласи визначають динамічний стан
      елементів, будуть мінятись з допомогою дій
      користувача.
      Псевдоелементи дозволяють задати стиль елементів не
      визначених в дереві елементів документа.
`,

    titleHtml: 'Html: теги, структура html сторінки, блочні та строчні елементи.',
    descriptionHtml: `
      HTML — стандартована мова розмітки веб-сторінок.
      Списки бувають нумеровані (ol) та марковані(ul),
      елементи списків – “li”.
      Табличне відображення інформації стає можливим з допомогою тега 'table'.
      Атрибут — використовується для визначення характеристик
      html-елемента.
      В html є теги для форматування текста.
      W3c – організація, яка розробляє та застосовує 
      технологічні стандарти для Всесвітньої павутини.
`,

    titleNodejs: 'Що таке nodejs, навіщо він потрібен та як встановити',
    descriptionNodejs: `
      Node.js — це JavaScript-оточення побудоване на
      ядрі Chrome V8.
      Node виконує дії на сервері. С допомогою Node
      можна писати повноцінні додатки. Node вміє
      працювати з зовнішніми бібліотеками, визивати команди із
      коду на JavaScript та виконувати роль веб-сервера.
      Для встановлення потрібно перейти на офіційний сайт
      https://nodejs.org та на головній сторінці скачати
      останню стабільну версію для своєї ОС.
`,

    titleNpm: 'Що таке менеджер пакетів, встановлення npm',
    descriptionNpm: `
      Менеджер пакетів — набір ПЗ яке дозволяє керувати 
      процесом установки, видалення, настройки та оновлення
      різних компонентів програмного забезпечення.
      Npm розповсюджується у комплекті з nodejs.
`,
  },

  PokeApi: {
    'See details': 'Детальніше',
    Description: 'Опис',
    Loading: 'Загрузка',
    Abilities: 'Можливості',
    'Pokemon Details': 'Детальніше про Покемона',
    Close: 'Закрити',
  },

  FirmStructure: {
    branches: 'Відділи',
    subBranches: 'Підвідділи',
    directors: 'Директори',
    Add: 'Додати',
    Remove: 'Видалити',
    Job: 'Посада',
    Surname: 'Прізвище',
    Salary: 'Зарплата',
    Title: 'Назва',
    Reset: 'Зкинути',
    'Input item to FirmStruct': 'Додати запис до "FirmStruct"',
    'Enter job': 'Введіть посаду',
    'Enter Name': 'Введіть Ім\'я',
    'Enter Surname': 'Введіть Прізвище',
    'Enter salary': 'Введіть зарплату',
    'Branch name': 'Назва відділу',
    'Enter branch name': 'Введіть назву відділу',
  },

  common: {
    Name: 'Ім\'я',
  },

};

export default ua;
